{"format": "layers-model", "generatedBy": "keras v2.15.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.15.1", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "fashion_recommender_temp_only", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 15], "dtype": "float32", "sparse": false, "ragged": false, "name": "main_colors"}, "name": "main_colors", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 78], "dtype": "float32", "sparse": false, "ragged": false, "name": "item_features"}, "name": "item_features", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "colors_reshape", "trainable": true, "dtype": "float32", "target_shape": [45]}, "name": "colors_reshape", "inbound_nodes": [[["main_colors", 0, 0, {}]]]}, {"class_name": "Masking", "config": {"name": "masking_layer", "trainable": true, "dtype": "float32", "mask_value": 0.0}, "name": "masking_layer", "inbound_nodes": [[["item_features", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "color_dense1", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "l2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "color_dense1", "inbound_nodes": [[["colors_reshape", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "item_mask"}, "name": "item_mask", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "item_lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "l2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "recurrent_regularizer": {"module": "keras.regularizers", "class_name": "l2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "item_lstm", "inbound_nodes": [[["masking_layer", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "color_dense2", "trainable": true, "dtype": "float32", "units": 24, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "l2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "color_dense2", "inbound_nodes": [[["color_dense1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "mask_dense", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "l2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "mask_dense", "inbound_nodes": [[["item_mask", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "target_temperature"}, "name": "target_temperature", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate_features", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_features", "inbound_nodes": [[["item_lstm", 0, 0, {}], ["color_dense2", 0, 0, {}], ["mask_dense", 0, 0, {}], ["target_temperature", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "l2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["concatenate_features", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "l2", "config": {"l2": 0.0005000000237487257}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output_dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output_dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}], "input_layers": [["item_features", 0, 0], ["item_mask", 0, 0], ["main_colors", 0, 0], ["target_temperature", 0, 0]], "output_layers": [["output_dense", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "color_dense1/kernel", "shape": [45, 32], "dtype": "float32"}, {"name": "color_dense1/bias", "shape": [32], "dtype": "float32"}, {"name": "color_dense2/kernel", "shape": [32, 24], "dtype": "float32"}, {"name": "color_dense2/bias", "shape": [24], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [73, 128], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [64], "dtype": "float32"}, {"name": "item_lstm/lstm_cell/kernel", "shape": [78, 128], "dtype": "float32"}, {"name": "item_lstm/lstm_cell/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "item_lstm/lstm_cell/bias", "shape": [128], "dtype": "float32"}, {"name": "mask_dense/kernel", "shape": [3, 16], "dtype": "float32"}, {"name": "mask_dense/bias", "shape": [16], "dtype": "float32"}, {"name": "output_dense/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "output_dense/bias", "shape": [1], "dtype": "float32"}]}]}